# 5 Вариант
Входные данные: целочисленная квадратная матрица.

Результат работы алгоритма: матрица, полученная из входной, путем замены местами строки с минимальным элементом и столбцом с максимальным.
    
    import numpy as np

    def swap_row_col(matrix):
    # Преобразуем ввод в np.array
        arr = np.array(matrix)

    # Определяем размеры матрицы
        n = arr.shape[0]
    
    # Находим индекс строки с минимальным элементом
        min_value = np.min(arr)
        min_row_index = np.where(arr == min_value)[0][0]
    
    # Находим индекс столбца с максимальным элементом
        max_value = np.max(arr)
        max_col_index = np.where(arr == max_value)[1][0]
    
    # Создаем новую матрицу для результата
        result = arr.copy()
    
    # Меняем местами строку с минимальным элементом и столбец с максимальным
        result[min_row_index, :], result[:, max_col_index] = arr[:, max_col_index], arr[min_row_index, :]

        return result
    
    if __name__ == "__main__":
    # Ввод матрицы
        firstLine = list(map(int, input("Введите 1-ю строку матрицы: ").split()))
        matrix = [firstLine]
        for i in range(1, len(firstLine)):
            nextLine = list(map(int, input("Введите %d-ю строку матрицы: " %(i+1)).split()))
            matrix.append(nextLine)


        print("Исходная матрица:")
        for row in matrix:
            print(row)
    
        result_matrix = swap_row_col(matrix)
    
        print("Результат работы алгоритма:")
        for row in result_matrix:
            print(row)